Repository: infabo/webm
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: de

# tx_webm_domain_model_queueitem.tablenames
source: Field "tablenames" (sys_file_reference)
de: Feld "tablenames" (sys_file_reference)

# tx_webm_domain_model_queueitem.fieldname
source: Field "fieldname" (sys_file_reference)
de: Feld "fieldname" (sys_file_reference)

# tx_webm_domain_model_queueitem.uid_foreign
source: Field "uid_foreign" (sys_file_reference)
de: Feld "uid_foreign" (sys_file_reference)

# tx_webm_domain_model_queueitem.sys_file_uid
source: Uid of original video (sys_file)
de: Uid des Original-Videos (sys_file)

# tx_webm_domain_model_queueitem.status_zero
source: in the queue
de: in der Warteschlange

# tx_webm_domain_model_queueitem.status_one
source: Original video not found
de: Original-Video nicht auffindbar

# tx_webm_domain_model_queueitem.status_two
source: MIME type not supported
de: MIME-Type wird nicht unterstützt

# tx_webm_domain_model_queueitem.status_three
source: Video larger than the maximum size defined in the extension settings
de: Video größer als die definierte Maximalgröße in den Extension-Settings

# tx_webm_domain_model_queueitem.status_four
source: Video successfully converted to webM format
de: Video erfolgreich in webM-Format konvertiert

# tx_webm_domain_model_queueitem.status_five
source: FileDoesNotExistException (more information in the logs)
de: FileDoesNotExistException (nähere Infos in den Logs)

# tx_webm_domain_model_queueitem.status_six
source: IllegalObjectTypeException (more information in the logs)
de: IllegalObjectTypeException (nähere Infos in den Logs)

# tx_webm_domain_model_queueitem.status_seven
source: RuntimeException (more information in the logs)
de: RuntimeException (nähere Infos in den Logs)

# tx_webm_domain_model_queueitem.convertionSuccessful
source: Video was successfully converted.
de: Video wurde erfolgreich konvertiert.

# tx_webm_domain_model_queueitem.addVideoToQueueSuccessful
source: Video was successfully added to the queue and will be converted on the next task execution.
de: Video wurde erfolgreich zur Queue hinzugefügt und wird bei der nächsten Task-Ausführung konvertiert.

# tx_webm_domain_model_queueitem.originalVideoNotFound
source: Original video could not be found or has been removed from the file list in the meantime.
de: Original-Video konnte nicht gefunden werden oder wurde zwischenzeitlich aus der Filelist entfernt.

# tx_webm_domain_model_queueitem.videoNotAddedToQueue
source: Video could not be added to the queue.
de: Video konnte nicht zur Queue hinzugefügt werden.

# tx_webm_domain_model_queueitem.errorConvertingVideo
source: There was an error converting the video.
de: Bei der Konvertierung des Videos ist ein Fehler aufgetreten.

# tx_webm_domain_model_queueitem.unexpectedError
source: An unexpected error occurred. Please check the log entries for more detailed information.
de: Ein unerwarteter Fehler ist aufgetreten. Bitte überprüfe die Log-Einträge für genauere Informationen.

# tx_webm_domain_model_queueitem.taskTitle
source: Converts video files in queue into webM format
de: Konvertiert Videodateien in der Warteschlange in das webM-Format

# extConf.convertOnSaveAction
source: Convert video on save action in backend (default=convert with task)
de: Video beim Speichern im Backend konvertieren (Standard = mit Task konvertieren)

# extConf.supportedMimeTypes
source: Supported mime types (comma separated)
de: Unterstützte MIME-Typen (kommagetrennt)

# extConf.maxFileSize
source: Max file size of original video to convert (videos which are larger wil be ignored)
de: Maximale Dateigröße des zu konvertierenden Original-Videos (größere Videos werden ignoriert)

# extConf.storageFolder
source: Save queue items in this folder/storage
de: Queue-Items in diesem Ordner/Storage speichern
